In [4]:
!pip install seaborn

Requirement already satisfied: seaborn in /Users/mako6/miniconda3/envs/py310/lib/python3.10/site-packages (0.12.2)
Requirement already satisfied: matplotlib!=3.6.1,>=3.1 in /Users/mako6/miniconda3/envs/py310/lib/python3.10/site-packages (from seaborn) (3.6.3)
Requirement already satisfied: numpy!=1.24.0,>=1.17 in /Users/mako6/miniconda3/envs/py310/lib/python3.10/site-packages (from seaborn) (1.24.1)
Requirement already satisfied: pandas>=0.25 in /Users/mako6/miniconda3/envs/py310/lib/python3.10/site-packages (from seaborn) (1.5.2)
Requirement already satisfied: kiwisolver>=1.0.1 in /Users/mako6/miniconda3/envs/py310/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (1.4.4)
Requirement already satisfied: python-dateutil>=2.7 in /Users/mako6/miniconda3/envs/py310/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (2.8.2)
Requirement already satisfied: pyparsing>=2.2.1 in /Users/mako6/miniconda3/envs/py310/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (3.0.9)
Requirement already satisfied: pillow>=6.2.0 in /Users/mako6/miniconda3/envs/py310/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (9.4.0)
Requirement already satisfied: packaging>=20.0 in /Users/mako6/miniconda3/envs/py310/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (23.0)
Requirement already satisfied: cycler>=0.10 in /Users/mako6/miniconda3/envs/py310/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in /Users/mako6/miniconda3/envs/py310/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (4.38.0)
Requirement already satisfied: contourpy>=1.0.1 in /Users/mako6/miniconda3/envs/py310/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (1.0.7)
Requirement already satisfied: pytz>=2020.1 in /Users/mako6/miniconda3/envs/py310/lib/python3.10/site-packages (from pandas>=0.25->seaborn) (2022.7.1)
Requirement already satisfied: six>=1.5 in /Users/mako6/miniconda3/envs/py310/lib/python3.10/site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.1->seaborn) (1.16.0)

In [5]:
import pandas as pd
import seaborn as sns

# Lade Beispieldatenset

In [6]:
# Lade Datenset
taxis_df = sns.load_dataset('taxis')

# Datenset anschauen: head, tail, index, column, info, shape, describe (inkl. Parameter)

In [24]:
taxis_df.head()

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
0,2019-03-23 20:21:09,2019-03-23 20:27:24,1,1.60,7.0,2.15,0.0,12.95,yellow,credit card,Lenox Hill West,UN/Turtle Bay South,Manhattan,Manhattan
1,2019-03-04 16:11:55,2019-03-04 16:19:00,1,0.79,5.0,0.00,0.0,9.30,yellow,cash,Upper West Side South,Upper West Side South,Manhattan,Manhattan
2,2019-03-27 17:53:01,2019-03-27 18:00:25,1,1.37,7.5,2.36,0.0,14.16,yellow,credit card,Alphabet City,West Village,Manhattan,Manhattan
3,2019-03-10 01:23:59,2019-03-10 01:49:51,1,7.70,27.0,6.15,0.0,36.95,yellow,credit card,Hudson Sq,Yorkville West,Manhattan,Manhattan
4,2019-03-30 13:27:42,2019-03-30 13:37:14,3,2.16,9.0,1.10,0.0,13.40,yellow,credit card,Midtown East,Yorkville West,Manhattan,Manhattan

In [25]:
taxis_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6433 entries, 0 to 6432
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   pickup           6433 non-null   datetime64[ns]
 1   dropoff          6433 non-null   datetime64[ns]
 2   passengers       6433 non-null   int64
 3   distance         6433 non-null   float64
 4   fare             6433 non-null   float64
 5   tip              6433 non-null   float64
 6   tolls            6433 non-null   float64
 7   total            6433 non-null   float64
 8   color            6433 non-null   object
 9   payment          6389 non-null   object
 10  pickup_zone      6407 non-null   object
 11  dropoff_zone     6388 non-null   object
 12  pickup_borough   6407 non-null   object
 13  dropoff_borough  6388 non-null   object
dtypes: datetime64[ns](2), float64(5), int64(1), object(6)
memory usage: 703.7+ KB

## Grundlegende Statistiken

In [7]:
taxis_df.describe() #include = 'all'

,passengers,distance,fare,tip,tolls,total
count,6433.000000,6433.000000,6433.000000,6433.00000,6433.000000,6433.000000
mean,1.539251,3.024617,13.091073,1.97922,0.325273,18.517794
std,1.203768,3.827867,11.551804,2.44856,1.415267,13.815570
min,0.000000,0.000000,1.000000,0.00000,0.000000,1.300000
25%,1.000000,0.980000,6.500000,0.00000,0.000000,10.800000
50%,1.000000,1.640000,9.500000,1.70000,0.000000,14.160000
75%,2.000000,3.210000,15.000000,2.80000,0.000000,20.300000
max,6.000000,36.700000,150.000000,33.20000,24.020000,174.820000

In [8]:
taxis_df.describe(exclude = 'number')

/var/folders/4m/zbm6lc054ws9njhzxj0l6cghklxfht/T/ipykernel_79015/166706507.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  taxis_df.describe(exclude = 'number')
/var/folders/4m/zbm6lc054ws9njhzxj0l6cghklxfht/T/ipykernel_79015/166706507.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  taxis_df.describe(exclude = 'number')

,pickup,dropoff,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
count,6433,6433,6433,6389,6407,6388,6407,6388
unique,6414,6425,2,2,194,203,4,5
top,2019-03-13 10:57:06,2019-03-04 18:08:13,yellow,credit card,Midtown Center,Upper East Side North,Manhattan,Manhattan
freq,2,2,5451,4577,230,245,5268,5206
first,2019-02-28 23:29:03,2019-02-28 23:32:35,NaN,NaN,NaN,NaN,NaN,NaN
last,2019-03-31 23:43:45,2019-04-01 00:13:58,NaN,NaN,NaN,NaN,NaN,NaN

# Konvertierung zu numpy array: values

# Serie vs. DataFrame

In [28]:
print('taxis_df:     ', type(taxis_df))
print('taxis_df["pickup"]:  ', type(taxis_df['pickup']))
print('taxis_df[["pickup"]]:', type(taxis_df[['pickup']]))

taxis_df:      <class 'pandas.core.frame.DataFrame'>
taxis_df["pickup"]:   <class 'pandas.core.series.Series'>
taxis_df[["pickup"]]: <class 'pandas.core.frame.DataFrame'>

# Slicing, Boolean indexing und ansprechen einzelner Elemente

In [10]:
taxis_df['color']
taxis_df[taxis_df['color'] == 'green']

taxis_df.loc[6430,'color']
taxis_df.iloc[[6430],[8]]

      color
6430  green

# Erstellen von leeren DataFrames

In [11]:
df_empty = pd.DataFrame({'A': []})
df_empty.empty

True

In [12]:
df_empty

Empty DataFrame
Columns: [A]
Index: []

# Spalte hinzufügen

In [13]:
df_empty['B'] = [1,2,3]

In [14]:
df_empty

    A  B
0 NaN  1
1 NaN  2
2 NaN  3

In [15]:
df_empty.empty

False

In [16]:
df_empty.loc[0,'A'] = 'test'
df_empty

      A  B
0  test  1
1   NaN  2
2   NaN  3

In [17]:
df_empty.columns = ['col_1', 'col_2']
df_empty

  col_1  col_2
0  test      1
1   NaN      2
2   NaN      3

## Missings egänzen / imputieren

In [18]:
df_fill = df_empty.fillna(0)
df_fill

  col_1  col_2
0  test      1
1     0      2
2     0      3

# <span style='color:Green'> *Aufgaben* <span>

# Grundlegende Statistiken: Summe, Varianez, Kreuztabelle

### Variable Explanations

| Variable | Explanation |
| --- | --- |
| pickup | The date and time when the meter was engaged. |
| dropoff | The date and time when the meter was disengaged. |
| passengers | The number of passengers in the vehicle. This is a driver-entered value. |
| distance | The elapsed trip distance in miles reported by the taximeter. |
| fare | The time-and-distance fare calculated by the meter. |
| tip | This field is automatically populated for credit card |
| tolls | Total amount of all tolls paid in trip. |
| total | The total amount charged to passengers. Does not include cash tips. |
| color | yellow = yellow taxis are the only vehicles permitted to respond to a street hail from a passenger in all five boroughs <br> green = green taxis, also known as boro taxis, are not permitted to respond to a street hail in Mannhatten up to W 110 St/E 96th S and at the airports |
| payment | Used payment method, 'credit card' or 'cash' |
| pickup_zone | TLC Taxi Zone in which the taximeter was engaged |
| dropoff_zone | TLC Taxi Zone in which the taximeter was disengaged |
| pickup_borough | borough in which the taximeter was engaged |
| dropoff_borough | borough in which the taximeter was disengaged |

https://www1.nyc.gov/site/tlc/about/tlc-trip-record-data.page (March 2019)

https://www1.nyc.gov/assets/tlc/downloads/pdf/trip_record_user_guide.pdf

if interested: [total charge calculation](https://www1.nyc.gov/site/tlc/passengers/taxi-fare.page)

## Kreuztabelle

In [19]:
pd.crosstab(index=taxis_df['color'], columns=taxis_df['pickup_borough'])

pickup_borough  Bronx  Brooklyn  Manhattan  Queens
color
green              83       313        294     288
yellow             16        70       4974     369

In [20]:
pd.crosstab(index=taxis_df['pickup_borough'], columns=taxis_df['dropoff_borough'])

dropoff_borough  Bronx  Brooklyn  Manhattan  Queens  Staten Island
pickup_borough
Bronx               66         4         25       4              0
Brooklyn             5       282         67      26              0
Manhattan           55       153       4885     163              2
Queens              11        62        224     349              0

## Korrelation

In [21]:
taxis_df.corr('spearman') #kendall

/var/folders/4m/zbm6lc054ws9njhzxj0l6cghklxfht/T/ipykernel_79015/816444937.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  taxis_df.corr('spearman') #kendall

            passengers  distance      fare       tip     tolls     total
passengers    1.000000  0.006844  0.003349  0.031389 -0.005689  0.024795
distance      0.006844  1.000000  0.925744  0.287309  0.364831  0.874097
fare          0.003349  0.925744  1.000000  0.308048  0.370392  0.947263
tip           0.031389  0.287309  0.308048  1.000000  0.173974  0.499290
tolls        -0.005689  0.364831  0.370392  0.173974  1.000000  0.380027
total         0.024795  0.874097  0.947263  0.499290  0.380027  1.000000

In [22]:
taxis_df.corr()

/var/folders/4m/zbm6lc054ws9njhzxj0l6cghklxfht/T/ipykernel_79015/2424309372.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  taxis_df.corr()

            passengers  distance      fare       tip     tolls     total
passengers    1.000000  0.009411  0.007637  0.021099 -0.002903  0.015708
distance      0.009411  1.000000  0.920108  0.452589  0.635267  0.904676
fare          0.007637  0.920108  1.000000  0.488612  0.609307  0.974358
tip           0.021099  0.452589  0.488612  1.000000  0.413619  0.646186
tolls        -0.002903  0.635267  0.609307  0.413619  1.000000  0.683142
total         0.015708  0.904676  0.974358  0.646186  0.683142  1.000000